"Today" = "Heute";
"Insights" = "Einblicke";
"Library" = "Bibliothek";
"Settings" = "Einstellungen";
"Quick Guide" = "Kurzanleitung";
"Log Meals" = "Mahlzeiten protokollieren";
"Adjust Your Goals" = "Ziele anpassen";
"The Weekly Bank" = "Die Wochenbank";
"Check Insights" = "Einblicke ansehen";
"Got it!" = "Verstanden!";
"Your History" = "Dein Verlauf";
"Close" = "Schließen";
"History" = "Verlauf";
"Meals" = "Mahlzeiten";
"No meals logged yet." = "Noch keine Mahlzeiten protokolliert.";
"Water" = "Wasser";
"Supplements" = "Ergänzungsmittel";
"Usually at this time..." = "Normalerweise um diese Zeit...";
"Log" = "Loggen";
"Protein" = "Protein";
"Carbs" = "Kohlenhydrate";
"Fat" = "Fett";
"Calories" = "Kalorien";
"Target" = "Ziel";
"Left" = "Übrig";
"Over" = "Drüber";

"%lld Day Streak" = "%lld Tage Streak";
"Perfect Days!" = "Perfekte Tage!";
"Smart Insights" = "Schlaue Einblicke";
"Based on your last logs, your True Metabolism (TDEE) is approx **%lld kcal** per day." = "Basierend auf deinen Daten liegt dein echter Stoffwechsel (TDEE) bei ca. **%lld kcal** pro Tag.";
"Weekly Calories" = "Wöchentliche Kalorien";
"Body Weight" = "Körpergewicht";
"Log Weight" = "Gewicht protokollieren";
"Log Body Weight" = "Körpergewicht loggen";
"Weight (e.g. 75.5)" = "Gewicht (z.B. 75.5)";
"Enter your weight for %@." = "Gib dein Gewicht für %@ ein.";
"Log your weight for a few days to see your trend." = "Trage dein Gewicht einige Tage lang ein, um den Trend zu sehen.";

"True TDEE: %lld kcal" = "Echter TDEE: %lld kcal";
"Target adjusted by %lld kcal due to weekly surplus." = "Ziel um %lld kcal angepasst (wöchentlicher Überschuss).";
"Target adjusted by %lld kcal due to weekly deficit." = "Ziel um %lld kcal angepasst (wöchentliches Defizit).";
"Active Energy: +%lld kcal" = "Aktive Energie: +%lld kcal";

"Data Management" = "Datenverwaltung";
"Connect to Apple Health" = "Mit Apple Health verbinden";
"Export Backup (.csv)" = "Backup exportieren (.csv)";
"Restore from Backup" = "Backup wiederherstellen";
"Apple Health Integration" = "Apple Health Integration";
"Eat Back Workout Calories" = "Trainingskalorien aufbrauchen";
"Forgiveness Safety Floor" = "Sicherheitsuntergrenze";
"Minimum Calories" = "Minimale Kalorien";
"Proactive Coach" = "Proaktiver Coach";
"Enable Daily Coach" = "Täglichen Coach aktivieren";
"Help" = "Hilfe";
"Show Quick Guide" = "Kurzanleitung anzeigen";
"Open Source" = "Open Source";
"View Source Code on GitHub" = "Quellcode auf GitHub ansehen";

"Search foods and recipes..." = "Nahrungsmittel und Rezepte suchen...";
"Search..." = "Suchen...";
"Scan Barcode" = "Barcode scannen";
"Custom Food" = "Eigenes Nahrungsmittel";
"Recipe" = "Rezept";
"Add" = "Hinzufügen";
"Cancel" = "Abbrechen";
"Save" = "Speichern";
"Done" = "Fertig";
"Log Meal" = "Mahlzeit loggen";

"Foods" = "Nahrungsmittel";
"Recipes" = "Rezepte";
"All" = "Alle";
"Drinks" = "Getränke";
"Fruits" = "Früchte";
"Vegetables" = "Gemüse";
"Meat" = "Fleisch";
"Dairy & Fats" = "Milch & Fette";
"Fast Food" = "Fast Food";
"Scanned" = "Gescannt";
"Looking up product..." = "Produkt wird gesucht...";
"Food Library" = "Nahrungsmittel";
"Recipe Library" = "Rezepte";
"No Foods" = "Keine Nahrungsmittel";
"Tap '+' to create food, or scan a barcode." = "Tippe '+', um ein Nahrungsmittel zu erstellen, oder scanne einen Barcode.";
"Delete" = "Löschen";
"No Recipes" = "Keine Rezepte";
"Tap '+' to combine foods into a recipe." = "Tippe '+', um Nahrungsmittel zu einem Rezept zu kombinieren.";
"Restaurant or Quick Meal" = "Restaurant oder Schnelle Mahlzeit";
"Don't know the exact macros? Just estimate the calories. Consistency is more important than perfect accuracy." = "Du kennst die Makros nicht genau? Schätze einfach die Kalorien. Konsistenz ist wichtiger als perfekte Genauigkeit.";
"e.g. Five Guys Cheeseburger" = "z.B. Five Guys Cheeseburger";
"Estimated Calories" = "Geschätzte Kalorien";
"Required" = "Erforderlich";
"How much did you eat?" = "Wie viel hast du gegessen?";
"Servings" = "Portionen";
"Calculated Nutrition" = "Berechnete Nährwerte";
"Volume (ml)" = "Volumen (ml)";
"Weight (grams)" = "Gewicht (Gramm)";
"Create Food" = "Nahrungsmittel erstellen";
"Name" = "Name";
"e.g. Banana" = "z.B. Banane";
"Barcode (Optional)" = "Barcode (Optional)";
"Scanned:" = "Gescannt:";
"Tap to scan" = "Tippen zum Scannen";
"Nutrition per 100g/ml" = "Nährwerte pro 100g/ml";
"Create" = "Erstellen";

// Notifications
"notification_reminder_title" = "Zeit, deine Mahlzeiten zu loggen! 🍽️";
"notification_reminder_body" = "Vergiss nicht, dein Abendessen zu tracken und dein Gewicht zu aktualisieren. Konsistenz ist der Schlüssel!";

"Use the Library tab below to log foods and recipes." = "Nutze den Tab 'Bibliothek', um Nahrungsmittel und Rezepte zu loggen.";
"Tap the target icon anytime to adjust macros and supplements." = "Tippe jederzeit auf das Ziel-Icon, um Makros und Supplements anzupassen.";
"Your daily targets adapt automatically to smooth out calorie spikes." = "Deine Tagesziele passen sich automatisch an, um Kalorienspitzen auszugleichen.";
"Use the Insights tab to see your weight, streak, and metabolism." = "Nutze den Tab 'Einblicke', um Gewicht, Streak und Stoffwechsel zu sehen.";

// Ultimate Features
"Calculating perfect combo..." = "Perfekte Kombination wird berechnet...";
"Couldn't find an exact match in your library." = "Keine exakte Übereinstimmung in deiner Bibliothek gefunden.";
"Try adding more diverse foods (pure protein, pure carbs, pure fats) to your library so the algorithm can combine them!" = "Versuche, unterschiedlichere Nahrungsmittel (reines Protein, Kohlenhydrate, Fette) zu deiner Bibliothek hinzuzufügen, damit der Algorithmus sie kombinieren kann!";
"To hit your remaining macros perfectly, eat this:" = "Um deine Makros perfekt zu treffen, iss das:";
"Log This Combo" = "Diese Kombi loggen";
"Refresh Suggestion" = "Vorschlag aktualisieren";
"Macro Tetris 🧩" = "Makro Tetris 🧩";
"Fasting Mode Active" = "Fastenmodus Aktiv";
"Time Since Last Meal" = "Zeit seit der letzten Mahlzeit";
"Social Day / Guilt-Free Mode" = "Social Day / Guilt-Free Modus";
"Mark this day as a social event. Overeating won't show red warnings, but the calories will still be balanced across the week." = "Markiere diesen Tag als soziales Event. Wenn du über dein Ziel isst, gibt es keine roten Warnungen, aber die Kalorien werden trotzdem über die Woche verrechnet.";
"Enable Social Day" = "Social Day aktivieren";
"New: Lock Screen Widgets! 📱" = "Neu: Sperrbildschirm Widgets! 📱";
"Track your calories and macros without opening the app. Long-press your home screen or lock screen to add the OffFat widget." = "Tracke deine Kalorien und Makros, ohne die App zu öffnen. Halte deinen Home- oder Sperrbildschirm gedrückt, um das OffFat Widget hinzuzufügen.";

// Onboarding
"Lose Weight" = "Abnehmen";
"Maintain" = "Gewicht halten";
"Build Muscle" = "Muskelaufbau";
"Couch / Office Job" = "Couch / Bürojob";
"Light (1-2x Sport/Wk)" = "Leicht (1-2x Sport/Woche)";
"Active (3-5x Sport/Wk)" = "Aktiv (3-5x Sport/Woche)";
"Athlete (Daily Hard Training)" = "Athlet (Täglich hartes Training)";
"Welcome to\nOffFat" = "Willkommen bei\nOffFat";
"100% Offline & Private" = "100% Offline & Privat";
"Your data never leaves this device." = "Deine Daten verlassen dieses Gerät nie.";
"Weekly Bank" = "Wochenbank";
"Balances your daily surplus or deficit over time." = "Gleicht deinen Überschuss oder dein Defizit über die Zeit aus.";
"Quick Logging" = "Schnelles Loggen";
"Easily add meals and track your daily macros." = "Erfasse ganz einfach Mahlzeiten und verfolge deine Makros.";
"Calorie Adaptation" = "Kalorienanpassung";
"Helps you understand your metabolism over time." = "Hilft dir, deinen Stoffwechsel langfristig zu verstehen.";
"Let's Build Your Profile" = "Lass uns dein Profil erstellen";
"About You" = "Über dich";
"We use these values to calculate base energy usage." = "Wir nutzen diese Werte, um deinen Grundumsatz zu berechnen.";
"Male" = "Männlich";
"Female" = "Weiblich";
"Age (Years)" = "Alter (Jahre)";
"Height (cm)" = "Größe (cm)";
"Current Weight (kg)" = "Aktuelles Gewicht (kg)";
"Continue" = "Weiter";
"Your Goals" = "Deine Ziele";
"Tell us what you want to achieve." = "Sag uns, was du erreichen möchtest.";
"Primary Goal" = "Hauptziel";
"Activity Level" = "Aktivitätslevel";
"Calculate My Macros" = "Meine Makros berechnen";
"Your Recommended Plan" = "Dein empfohlener Plan";
"These targets serve as an initial estimate, and adapt to your log updates." = "Diese Ziele sind eine erste Schätzung und passen sich deinen Logs an.";
"Daily Calories (kcal)" = "Tägliche Kalorien (kcal)";
"Protein" = "Protein";
"Carbs" = "Kohlenhydrate";
"Fats" = "Fette";
"Start Tracking" = "Tracking starten";

// Categories
"All" = "Alle";
"Drinks" = "Getränke";
"Fruits" = "Früchte";
"Vegetables" = "Gemüse";
"Meat" = "Fleisch";
"Dairy & Fats" = "Milch & Fette";
"Fast Food" = "Fast Food";
"Other" = "Andere";

// Settings
"Data Management" = "Datenverwaltung";
"Because OffFat is 100% offline, use these buttons to backup your data or move it to a new iPhone." = "Da OffFat zu 100% offline ist, nutze diese Buttons für Backups oder einen iPhone-Wechsel.";
"Connect to Apple Health" = "Mit Apple Health verbinden";
"Export Backup (.csv)" = "Backup exportieren (.csv)";
"Restore from Backup" = "Backup wiederherstellen";
"Forgiveness Safety Floor" = "Sicherheitsgrenze";
"The Weekly Bank will never drop your daily target below this minimum calorie limit, even after a large surplus." = "Die Wochenbank senkt dein Kalorienziel niemals unter dieses Limit, selbst nach einem großen Überschuss.";
"Minimum Calories" = "Minimum Kalorien";
"Proactive Coach" = "Proaktiver Coach";
"Receive offline daily reminders to take your supplements and hit your protein goals." = "Erhalte Offline-Erinnerungen für deine Supplements und Proteinziele.";
"Enable Daily Coach" = "Täglichen Coach aktivieren";
"Help" = "Hilfe";
"Show Quick Guide" = "Kurzanleitung anzeigen";
"Open Source" = "Open Source";
"OffFat is 100% free and open source. Check out the code or contribute on GitHub." = "OffFat ist zu 100% kostenlos und Open Source. Sieh dir den Code an oder trage auf GitHub dazu bei.";
"View Source Code on GitHub" = "Quellcode auf GitHub ansehen";
